//Task11
//დავწეროთ ჩვენი იმპლემენტაცია მასივის filter მეთოდის,
// დავარქვათ myFilter, პარამეტრად უნდა გადაეცემოდეს პირველ 
//ადგილას მასივი, ხოლო მეორეზე 
//  ფუნქცია, რომლიც მიხედვითაც უნდა გაიფილტროს მასივი,
//აუცილებელია შემოწმდეს რომ პირველი პარამეტრი არის მასივი, 
//ხოლო მეორე ფუნქცია
// ერთ-ერთი პირობის დარღვევის შემთხვევაში დაილოგოს შესამაბილი ერორი

//გამოძახების მაგალითი

// myFilter([1,2,3], (el) => el % 2 ) // 2

// myFilter('asd' , (el) => el % 2) // First parameter should be an array


let myFilter = [1,2,3];
myFilter = myFilter.filter (el => !(el % 2 === 1));

console.log(myFilter)
