//Task8

//დაწერეთ ფუნქცია sum,რომელსაც შეიძლება გადაეცეს განუსაზღვრელი რაოდენობის 
// პარამეტრები და უნდა დააბრუნოს მათი ჯამი, ფუნქციას დაედოს შემოწმება 
//რომ ყველა პარამეტრი არის რიცხვი, ხოლო წინააღმდეგ შემტხვევაში დალოგოს შეცდომა

//გამოძახების მაგალითი

// sum(1,2,3) //6
// sum(2,2,2) //6
// sum(1,2,'a') // Error,try again



let x = sumAll(1,2,3);

function sumAll() {
    let sum = 0;
    for (let i = 0; i < arguments.length; i++) {
        sum += arguments[i];
    }
    return sum;
}

console.log(x);

